In [36]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [37]:
titanic_raw_data = pd.read_csv('titanic.csv')

titanic_raw_data.columns

Index(['PassengerId', 'Name', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [38]:
titanic_data = titanic_raw_data[['Pclass', 'Sex', 'Age', 'Fare', 'Cabin', 'Survived']]

titanic_data.columns

Index(['Pclass', 'Sex', 'Age', 'Fare', 'Cabin', 'Survived'], dtype='object')

In [39]:
from sklearn.preprocessing import OneHotEncoder
oh = OneHotEncoder(handle_unknown='ignore', sparse_output=False)

sex = oh.fit_transform(titanic_data[['Sex']])

col_name = oh.get_feature_names_out(['Sex'])

sex = pd.DataFrame(data=sex, columns=col_name)

titanic_data = titanic_data.drop(['Sex'], axis = 1)

titanic_data = pd.concat([titanic_data, sex], axis= 1)

In [40]:
titanic_data.head()
# col_name

   Pclass   Age     Fare Cabin  Survived  Sex_female  Sex_male
0       3  22.0   7.2500   NaN         0         0.0       1.0
1       1  38.0  71.2833   C85         1         1.0       0.0
2       3  26.0   7.9250   NaN         1         1.0       0.0
3       1  35.0  53.1000  C123         1         1.0       0.0
4       3  35.0   8.0500   NaN         0         0.0       1.0

In [41]:
titanic_data = titanic_data.drop(['Cabin'], axis= 1)

In [43]:
titanic_data.head()

   Pclass   Age     Fare  Survived  Sex_female  Sex_male
0       3  22.0   7.2500         0         0.0       1.0
1       1  38.0  71.2833         1         1.0       0.0
2       3  26.0   7.9250         1         1.0       0.0
3       1  35.0  53.1000         1         1.0       0.0
4       3  35.0   8.0500         0         0.0       1.0

In [47]:
titanic_data.Age.isnull().sum()

np.int64(177)

In [50]:
from sklearn.impute import SimpleImputer

si = SimpleImputer(strategy='mean')
age = pd.DataFrame(si.fit_transform(titanic_data[['Age']]))

titanic_data.Age = age

In [52]:
titanic_data.Age.isnull().sum()

np.int64(0)

In [53]:
X = titanic_data.drop(['Survived'], axis = 1)
y = titanic_data.Survived

from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, train_size=0.8)

In [55]:
from sklearn.naive_bayes import GaussianNB

model = GaussianNB()

model.fit(X_train, y_train)

model.score(X_test, y_test)

0.7932960893854749